In [128]:
import pandas as pd
import numpy as np

# 1.1 Структура данных Series

In [129]:
shares = {'ММК': 52.50, 'Северсталь': 1386.20, 'НЛМК': 214.20} 

ser = pd.Series(shares, index=['ММК', 'Северсталь'])

ser

ММК             52.5
Северсталь    1386.2
dtype: float64

In [130]:
ser = pd.Series(data=0, index=range(5))

ser

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [131]:
from string import ascii_lowercase

ser = pd.Series(range(1, 8), list(ascii_lowercase[0:7]))

print(ser)

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [132]:
[chr(c) for c in range(ord('a'), ord('g') + 1)]

['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [133]:
d = {"Moody's": "США", "Standard & Poor's": "США", "Fitch Ratings": "США",
     "АКРА": "Россия", "Эксперт РА": "Россия", "НРА": "Россия"}
srs = pd.Series(d)
# Продолжите написание кода здесь

srs[::2]

Moody's             США
Fitch Ratings       США
Эксперт РА       Россия
dtype: object

In [134]:
d = {'BANE': 'ПАО АНК "Башнефть"', 'LKOH': 'ПАО "ЛУКОЙЛ"', 
     'NVTK': 'ПАО "НОВАТЭК"', 'ROSN': 'ПАО "НК "Роснефть"',
     'TATN': 'ПАО "Татнефть" им. В.Д.Шашина', 'TRNFL': 'ПАО "Транснефть"'}
srs = pd.Series(d)
# Продолжите написание кода здесь

tickers = ['GAZP', 'SIBN', 'SNGS']
stocks = ['ПАО "Газпром"', 'ПАО "Газпром нефть"', 'ПАО "Сургутнефтегаз"']

for i in range(len(tickers)):
    srs[tickers[i]] = stocks[i]

srs

BANE                ПАО АНК "Башнефть"
LKOH                      ПАО "ЛУКОЙЛ"
NVTK                     ПАО "НОВАТЭК"
ROSN                ПАО "НК "Роснефть"
TATN     ПАО "Татнефть" им. В.Д.Шашина
TRNFL                 ПАО "Транснефть"
GAZP                     ПАО "Газпром"
SIBN               ПАО "Газпром нефть"
SNGS              ПАО "Сургутнефтегаз"
dtype: object

In [135]:
d.update({'GAZP': 'ПАО "Газпром"', 'SIBN': 'ПАО "Газпром нефть"', 'SNGS': 'ПАО "Сургутнефтегаз"'})
srs = pd.Series(d)
srs

BANE                ПАО АНК "Башнефть"
LKOH                      ПАО "ЛУКОЙЛ"
NVTK                     ПАО "НОВАТЭК"
ROSN                ПАО "НК "Роснефть"
TATN     ПАО "Татнефть" им. В.Д.Шашина
TRNFL                 ПАО "Транснефть"
GAZP                     ПАО "Газпром"
SIBN               ПАО "Газпром нефть"
SNGS              ПАО "Сургутнефтегаз"
dtype: object

In [136]:
# Поменяйте местами колонки индексов и значений.
d = {'BSPB': 'ПАО "Банк "Санкт-Петербург"', 'CBOM': 'ПАО "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК"', 
     'ROSB': 'ПАО РОСБАНК', 'SBER': 'ПАО Сбербанк',
     'USBN': 'ПАО "БАНК УРАЛСИБ"', 'VTBR': 'Банк ВТБ (ПАО)'}
srs = pd.Series(d)
srs

BSPB        ПАО "Банк "Санкт-Петербург"
CBOM    ПАО "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК"
ROSB                        ПАО РОСБАНК
SBER                       ПАО Сбербанк
USBN                 ПАО "БАНК УРАЛСИБ"
VTBR                     Банк ВТБ (ПАО)
dtype: object

In [137]:
pd.Series(srs.index.values, index=srs)

ПАО "Банк "Санкт-Петербург"        BSPB
ПАО "МОСКОВСКИЙ КРЕДИТНЫЙ БАНК"    CBOM
ПАО РОСБАНК                        ROSB
ПАО Сбербанк                       SBER
ПАО "БАНК УРАЛСИБ"                 USBN
Банк ВТБ (ПАО)                     VTBR
dtype: object

In [138]:
# Удалите из серии каждое чётное значение.
d = {'AMEZ': 'ПАО "Ашинский метзавод"', 'CHMF': 'ПАО "Северсталь"', 
     'CHMK': 'ПАО "ЧМК"', 'GMKN': 'ПАО "ГМК "Норильский никель"',
     'MAGN': 'ПАО "ММК"', 'MTLR': 'ПАО "Мечел"',
     'NLMK': 'ПАО "НЛМК"', 'RUAL': 'МКПАО "ОК РУСАЛ"',
     'TRMK': 'ПАО "ТМК"'}
srs = pd.Series(d)
srs

AMEZ         ПАО "Ашинский метзавод"
CHMF                ПАО "Северсталь"
CHMK                       ПАО "ЧМК"
GMKN    ПАО "ГМК "Норильский никель"
MAGN                       ПАО "ММК"
MTLR                     ПАО "Мечел"
NLMK                      ПАО "НЛМК"
RUAL                МКПАО "ОК РУСАЛ"
TRMK                       ПАО "ТМК"
dtype: object

In [139]:
print(srs.drop(srs[1::2].index))
print(srs.drop(srs.index[1::2]))

AMEZ    ПАО "Ашинский метзавод"
CHMK                  ПАО "ЧМК"
MAGN                  ПАО "ММК"
NLMK                 ПАО "НЛМК"
TRMK                  ПАО "ТМК"
dtype: object
AMEZ    ПАО "Ашинский метзавод"
CHMK                  ПАО "ЧМК"
MAGN                  ПАО "ММК"
NLMK                 ПАО "НЛМК"
TRMK                  ПАО "ТМК"
dtype: object

In [140]:
d1 = {'2022': 1184477, '2021': 1316948, '2020': 1116969}
srs1 = pd.Series(d1, name='Выручка, в млн рублей')
d2 = {'2022': 426329, '2021': 372728, '2020': 324308}
srs2 = pd.Series(d2, name='Себестоимость реализованных металлов, в млн рублей')
d3 = {'2022': 56137, '2021': 54862, '2020': 40482}
srs3 = pd.Series(d3, name='Себестоимость прочей реализации, в млн рублей')
# Продолжите написание кода здесь
srs = pd.Series(srs1.sub(srs2 + srs3), name = 'Валовая прибыль, в млн рублей')
srs

2022    702011
2021    889358
2020    752179
Name: Валовая прибыль, в млн рублей, dtype: int64

In [141]:
# P/E = Капитализация / Чистая прибыль

# P/E является самым популярным мультипликатором, который сравнивает стоимость компании с главным итогом деятельности - чистой прибылью. 
# В классическом варианте для сравнения берутся капитализация за последний торговый день года и чистая прибыль за этот год.
# По сути, отношений цены к чистой прибыли показывает сумму в рублях, которую инвестор может инвестировать в компанию, чтобы получить один рубль прибыли этой компании.
# При сравнении двух компаний P/E показывает, насколько рубль чистой прибыли одной компании оценивается инвесторами выше, чем рубль чистой прибыли другой. 
# При прочих равных условиях интереснее та компания, у которой значение P/E меньше, а значит есть вероятность того, что она недооценена и ее акции могут расти быстрее.

In [142]:

d1 = {'ПАО "Россети"': 54_210_000_000, 'ПАО "РусГидро"': 19_325_000_000, 
      'ПАО "Юнипро"': 21_267_722_000}
srs1 = pd.Series(d1, name='Чистая прибыль за 2022 год, руб.')
d2 = {'ПАО "Россети"': 110_844_896_493.56, 'ПАО "РусГидро"': 333_200_635_086.47, 
      'ПАО "Юнипро"': 84_863_558_471.17}
srs2 = pd.Series(d2, name='Капитализация на конец 2022 года, в млн рублей')
# Продолжите написание кода здесь

srs = pd.Series(srs2.div(srs1).round(1), name='P/E 2022 год')

print(srs1, srs2, srs, sep='\n\n')

ПАО "Россети"     54210000000
ПАО "РусГидро"    19325000000
ПАО "Юнипро"      21267722000
Name: Чистая прибыль за 2022 год, руб., dtype: int64

ПАО "Россети"     1.108449e+11
ПАО "РусГидро"    3.332006e+11
ПАО "Юнипро"      8.486356e+10
Name: Капитализация на конец 2022 года, в млн рублей, dtype: float64

ПАО "Россети"      2.0
ПАО "РусГидро"    17.2
ПАО "Юнипро"       4.0
Name: P/E 2022 год, dtype: float64

In [143]:
amounts = [300_000, 200_000, 500_000, 700_000, 1_000_000]
days = [30, 60, 90, 120, 180]
rates = [10, 11, 11, 12, 14]
amounts = pd.Series(amounts, name='Сумма депозита')
days = pd.Series(days, name='Дни')
rates = pd.Series(rates, name='Ставки')
# Продолжите написание кода здесь

ser = pd.Series(amounts * (days / 365) * rates * 0.01 + amounts)
ser

0    3.024658e+05
1    2.036164e+05
2    5.135616e+05
3    7.276164e+05
4    1.069041e+06
dtype: float64

In [144]:
lst1 = ['2023-01-01', '2023-02-01', '2023-03-01', '2023-04-01',
        '2023-05-01', '2023-06-01', '2023-07-01', '2023-08-01',]
srs1 = pd.Series(lst1)
srs2 = pd.Series('2020-01-01', index=range(8))
# Продолжите написание кода здесь

srs1 = srs1.astype('datetime64[ns]')
srs2 = srs2.astype('datetime64[ns]')

pd.Series(srs1 - srs2, dtype='timedelta64[ns]')

0   1096 days
1   1127 days
2   1155 days
3   1186 days
4   1216 days
5   1247 days
6   1277 days
7   1308 days
dtype: timedelta64[ns]

In [145]:
# Трейдер выставил биржевые заявки на покупку акций по ценам, представленным в серии srs1. 
# Некоторые из этих заявок исполнились, и в серии srs2 находятся данные по количеству купленных ценных бумаг.

d1 = {'ПАО "Газпром"': 162.5, 'Банк ВТБ (ПАО)': 0.024, 'ПАО "Аэрофлот"': 36.5, 
      'ПАО "Магнит"': 6200, 'ПАО "Газпром нефть"': 830}
d2 = {'ПАО "Аэрофлот"': 10_000, 'Банк ВТБ (ПАО)': 10_000_000, 'ПАО "Газпром"': 1_000}
srs1 = pd.Series(d1, name='Цена в заявке на покупку, руб.')
srs2 = pd.Series(d2, name='Количество купленных акций, шт.')
# Продолжите написание кода здесь

ser1 = pd.Series(srs1 * srs2)
ser2 = pd.Series(srs1.mul(srs2, fill_value=0))

print(srs1)
print()
print(srs2)
print()
print(ser1)
print()
print(ser2)

ПАО "Газпром"           162.500
Банк ВТБ (ПАО)            0.024
ПАО "Аэрофлот"           36.500
ПАО "Магнит"           6200.000
ПАО "Газпром нефть"     830.000
Name: Цена в заявке на покупку, руб., dtype: float64

ПАО "Аэрофлот"       10000
Банк ВТБ (ПАО)    10000000
ПАО "Газпром"         1000
Name: Количество купленных акций, шт., dtype: int64

Банк ВТБ (ПАО)         240000.0
ПАО "Аэрофлот"         365000.0
ПАО "Газпром нефть"         NaN
ПАО "Газпром"          162500.0
ПАО "Магнит"                NaN
dtype: float64

Банк ВТБ (ПАО)         240000.0
ПАО "Аэрофлот"         365000.0
ПАО "Газпром нефть"         0.0
ПАО "Газпром"          162500.0
ПАО "Магнит"                0.0
dtype: float64

In [146]:
# На вход подается строка, содержащая шесть натуральных чисел, разделенных пробелами.

# На основе этих чисел создайте объект Series.
# Затем возведите в степень значения этой серии таким образом, чтобы первое значение возвелось в первую степень, 
# второе значение - во вторую степень, третье - в третью, четвертое - в четвертую, пятое - в пятую и шестое значение - в шестую степень.
# Выведите полученный объект Series на печать.

# numbers = list(map(int, input().split()))
numbers = [4, 6, 3, 5, 3, 4]

ser = pd.Series(numbers)

print(ser)
print()
print(ser ** (np.arange(len(numbers)) + 1))

0    4
1    6
2    3
3    5
4    3
5    4
dtype: int64

0       4
1      36
2      27
3     625
4     243
5    4096
dtype: int64

# 2.1 Структура данных DataFrame

In [147]:
srs1 = pd.Series([15, 20, 50], name='Количество')
srs2 = pd.Series([200, 450.5, 1800], name='Цена')
print(srs1, srs2, sep='\n\n')

df = pd.DataFrame([srs1, srs2])

display(df)

df = df.T

display(df)

0    15
1    20
2    50
Name: Количество, dtype: int64

0     200.0
1     450.5
2    1800.0
Name: Цена, dtype: float64

                0      1       2
Количество   15.0   20.0    50.0
Цена        200.0  450.5  1800.0

   Количество    Цена
0        15.0   200.0
1        20.0   450.5
2        50.0  1800.0

In [148]:
nda = np.array([[15, 200], [20, 450.5], [50, 1800]])

print(nda)

[[  15.   200. ]
 [  20.   450.5]
 [  50.  1800. ]]

In [149]:
df = pd.DataFrame(nda, columns=['Количество', 'Цена'])

display(df)

   Количество    Цена
0        15.0   200.0
1        20.0   450.5
2        50.0  1800.0

In [150]:
car_sales_values = [['TOYOTA', 'VOLKSWAGEN GROUP', 'GENERAL MOTORS', 'STELLANTIS', 'FORD', 'HONDA', 
              'NISSAN', 'BMW', 'MERCEDES', 'TESLA'],
             [10_483_000, 8_300_000, 5_900_000, 5_800_000, 4_231_000, 4_074_000, 3_225_549,
              2_399_636, 2_043_900, 1_310_000],
             [1_940_000, 3_200_000, 2_300_000, 94_000, 495_000, 1_579_000, 1_045_197,
              791_985, 751_700, 439_770],
             [18.51, 38.55, 38.98, 1.62, 11.7, 38.76, 32.4, 33.0, 36.78, 33.57]]
car_sales_columns = ['Автопроизводитель', 'Продано по всему миру в 1 полугодии 2023', 'Продано в Китае', '%']
car_sales = pd.DataFrame(car_sales_values)
display(car_sales)

,0,1,2,3,4,5,6,7,8,9
0,TOYOTA,VOLKSWAGEN GROUP,GENERAL MOTORS,STELLANTIS,FORD,HONDA,NISSAN,BMW,MERCEDES,TESLA
1,10483000,8300000,5900000,5800000,4231000,4074000,3225549,2399636,2043900,1310000
2,1940000,3200000,2300000,94000,495000,1579000,1045197,791985,751700,439770
3,18.51,38.55,38.98,1.62,11.7,38.76,32.4,33.0,36.78,33.57

In [151]:
moscow_exchange_values = [['2023-03-01', 2279.65, 2258.89, 2287.48, 2255.45, 1.18],
       ['2023-03-02', 2254.3, 2284.87, 2286.27, 2235.43, -1.11],
       ['2023-03-03', 2272.2, 2250.12, 2273.52, 2249.81, 0.79],
       ['2023-03-06', 2294.12, 2286.2, 2297.86, 2283.4, 0.96],
       ['2023-03-07', 2295.6, 2294.32, 2298.93, 2281.46, 0.06],
       ['2023-03-09', 2290.14, 2295.03, 2302.1, 2278.95, -0.24],
       ['2023-03-10', 2276.25, 2272.61, 2283.18, 2266.33, -0.61]]
moscow_exchange_columns = ['Дата', 'Цена', 'Откр.', 'Макс.', 'Мин.', 'Изм. %']
moex = pd.DataFrame(moscow_exchange_values, columns=moscow_exchange_columns)  
# Продолжите написание кода здесь

moex.columns = list(i.lower() for i in moex.columns)

In [152]:
# Добавление нового столбца в датафрейм

brent_values = [['20231002', 92.47, 90.48], ['20231003', 90.48, 91.1],
                ['20231004', 91.1, 86.09], ['20231005', 86.09, 84.18],
                ['20231006', 84.18, 84.47], ['20231008', 84.43, 87.37],
                ['20231009', 87.38, 88.25], ['20231010', 88.25, 87.72],
                ['20231011', 87.72, 85.54], ['20231012', 85.54, 86.26],
                ['20231013', 86.26, 90.94]]
brent_columns = ['date', 'open', 'close']
brent = pd.DataFrame(brent_values, columns=brent_columns)

# Данные для нового
brent_low = pd.Series([90.35, 89.5, 85.75, 83.84, 83.44, 84.43, 86.42, 86.91, 85.21, 85.18, 86.26])

brent['date'] = brent['date'].astype('datetime64[ns]')

display(brent)

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [153]:
# Вставка колонки по индексу
brent.insert(loc=1, column='low', value=brent_low)

display(brent)

         date    low   open  close
0  2023-10-02  90.35  92.47  90.48
1  2023-10-03  89.50  90.48  91.10
2  2023-10-04  85.75  91.10  86.09
3  2023-10-05  83.84  86.09  84.18
4  2023-10-06  83.44  84.18  84.47
5  2023-10-08  84.43  84.43  87.37
6  2023-10-09  86.42  87.38  88.25
7  2023-10-10  86.91  88.25  87.72
8  2023-10-11  85.21  87.72  85.54
9  2023-10-12  85.18  85.54  86.26
10 2023-10-13  86.26  86.26  90.94

In [154]:
# Изменить порядок расположения элементов датафрейма на противоположный:
brent = brent[::-1]
display(brent)

         date    low   open  close
10 2023-10-13  86.26  86.26  90.94
9  2023-10-12  85.18  85.54  86.26
8  2023-10-11  85.21  87.72  85.54
7  2023-10-10  86.91  88.25  87.72
6  2023-10-09  86.42  87.38  88.25
5  2023-10-08  84.43  84.43  87.37
4  2023-10-06  83.44  84.18  84.47
3  2023-10-05  83.84  86.09  84.18
2  2023-10-04  85.75  91.10  86.09
1  2023-10-03  89.50  90.48  91.10
0  2023-10-02  90.35  92.47  90.48

In [155]:
brent.reset_index(drop=True, inplace=True)

display(brent)

         date    low   open  close
0  2023-10-13  86.26  86.26  90.94
1  2023-10-12  85.18  85.54  86.26
2  2023-10-11  85.21  87.72  85.54
3  2023-10-10  86.91  88.25  87.72
4  2023-10-09  86.42  87.38  88.25
5  2023-10-08  84.43  84.43  87.37
6  2023-10-06  83.44  84.18  84.47
7  2023-10-05  83.84  86.09  84.18
8  2023-10-04  85.75  91.10  86.09
9  2023-10-03  89.50  90.48  91.10
10 2023-10-02  90.35  92.47  90.48

In [156]:
# Изменить порядок столбцов
brent = brent[brent.columns[::-1]]
brent

    close   open    low       date
0   90.94  86.26  86.26 2023-10-13
1   86.26  85.54  85.18 2023-10-12
2   85.54  87.72  85.21 2023-10-11
3   87.72  88.25  86.91 2023-10-10
4   88.25  87.38  86.42 2023-10-09
5   87.37  84.43  84.43 2023-10-08
6   84.47  84.18  83.44 2023-10-06
7   84.18  86.09  83.84 2023-10-05
8   86.09  91.10  85.75 2023-10-04
9   91.10  90.48  89.50 2023-10-03
10  90.48  92.47  90.35 2023-10-02

In [157]:
# Параметр mapper метода rename()

brent_values = [['20231002', 92.47, 90.48], ['20231003', 90.48, 91.1],
                ['20231004', 91.1, 86.09], ['20231005', 86.09, 84.18],
                ['20231006', 84.18, 84.47], ['20231008', 84.43, 87.37],
                ['20231009', 87.38, 88.25], ['20231010', 88.25, 87.72],
                ['20231011', 87.72, 85.54], ['20231012', 85.54, 86.26],
                ['20231013', 86.26, 90.94]]
brent_columns = ['date', 'open', 'close']
brent = pd.DataFrame(brent_values, columns=brent_columns)

# Данные для нового
brent_low = pd.Series([90.35, 89.5, 85.75, 83.84, 83.44, 84.43, 86.42, 86.91, 85.21, 85.18, 86.26])

brent['date'] = brent['date'].astype('datetime64[ns]')

display(brent)

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [158]:
brent.rename(str.lower, axis='columns', inplace=True)
brent

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [159]:
brent.rename(mapper=str.upper, axis=1, inplace=True)
brent

         DATE   OPEN  CLOSE
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [160]:
brent.rename(lambda x: x+21, axis=0, inplace=True)

display(brent)

         DATE   OPEN  CLOSE
21 2023-10-02  92.47  90.48
22 2023-10-03  90.48  91.10
23 2023-10-04  91.10  86.09
24 2023-10-05  86.09  84.18
25 2023-10-06  84.18  84.47
26 2023-10-08  84.43  87.37
27 2023-10-09  87.38  88.25
28 2023-10-10  88.25  87.72
29 2023-10-11  87.72  85.54
30 2023-10-12  85.54  86.26
31 2023-10-13  86.26  90.94

# Методы add_prefix() и add_suffix()

In [161]:
brent_values = [['20231002', 92.47, 90.48], ['20231003', 90.48, 91.1],
                ['20231004', 91.1, 86.09], ['20231005', 86.09, 84.18],
                ['20231006', 84.18, 84.47], ['20231008', 84.43, 87.37],
                ['20231009', 87.38, 88.25], ['20231010', 88.25, 87.72],
                ['20231011', 87.72, 85.54], ['20231012', 85.54, 86.26],
                ['20231013', 86.26, 90.94]]
brent_columns = ['date', 'open', 'close']
brent = pd.DataFrame(brent_values, columns=brent_columns)

# Данные для нового
brent_low = pd.Series([90.35, 89.5, 85.75, 83.84, 83.44, 84.43, 86.42, 86.91, 85.21, 85.18, 86.26])

brent['date'] = brent['date'].astype('datetime64[ns]')

display(brent)

         date   open  close
0  2023-10-02  92.47  90.48
1  2023-10-03  90.48  91.10
2  2023-10-04  91.10  86.09
3  2023-10-05  86.09  84.18
4  2023-10-06  84.18  84.47
5  2023-10-08  84.43  87.37
6  2023-10-09  87.38  88.25
7  2023-10-10  88.25  87.72
8  2023-10-11  87.72  85.54
9  2023-10-12  85.54  86.26
10 2023-10-13  86.26  90.94

In [162]:
brent.add_prefix('brent_')

   brent_date  brent_open  brent_close
0  2023-10-02       92.47        90.48
1  2023-10-03       90.48        91.10
2  2023-10-04       91.10        86.09
3  2023-10-05       86.09        84.18
4  2023-10-06       84.18        84.47
5  2023-10-08       84.43        87.37
6  2023-10-09       87.38        88.25
7  2023-10-10       88.25        87.72
8  2023-10-11       87.72        85.54
9  2023-10-12       85.54        86.26
10 2023-10-13       86.26        90.94

In [163]:
brent.add_suffix('_brent')

   date_brent  open_brent  close_brent
0  2023-10-02       92.47        90.48
1  2023-10-03       90.48        91.10
2  2023-10-04       91.10        86.09
3  2023-10-05       86.09        84.18
4  2023-10-06       84.18        84.47
5  2023-10-08       84.43        87.37
6  2023-10-09       87.38        88.25
7  2023-10-10       88.25        87.72
8  2023-10-11       87.72        85.54
9  2023-10-12       85.54        86.26
10 2023-10-13       86.26        90.94

In [164]:
brent.add_prefix('asd_', axis=0)

             date   open  close
asd_0  2023-10-02  92.47  90.48
asd_1  2023-10-03  90.48  91.10
asd_2  2023-10-04  91.10  86.09
asd_3  2023-10-05  86.09  84.18
asd_4  2023-10-06  84.18  84.47
asd_5  2023-10-08  84.43  87.37
asd_6  2023-10-09  87.38  88.25
asd_7  2023-10-10  88.25  87.72
asd_8  2023-10-11  87.72  85.54
asd_9  2023-10-12  85.54  86.26
asd_10 2023-10-13  86.26  90.94

In [165]:
brent = brent.set_index('date')

brent.T

date,2023-10-02,2023-10-03,2023-10-04,2023-10-05,2023-10-06,2023-10-08,2023-10-09,2023-10-10,2023-10-11,2023-10-12,2023-10-13
open,92.47,90.48,91.10,86.09,84.18,84.43,87.38,88.25,87.72,85.54,86.26
close,90.48,91.10,86.09,84.18,84.47,87.37,88.25,87.72,85.54,86.26,90.94

# 2.3 Доступ к данным